Autodesk.Revit.DB.Structure.RebarShapeListeningDimension.GetVertexId(System.Int32)
Returns:
may return -1 if reference to whole edge

Autodesk.Revit.DB.Structure.RebarShapeListeningDimension
Reporting dimensions that corresponds to read-only shape parameters.